yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
sfr         P3M1        =           0xb1;
sfr         P3M0        =           0xb2;
sfr         P4M1        =           0xb3;
sfr         P4M0        =           0xb4;

sfr         IP2         =           0xb5;
    sbit    PUSB        =           IP2^7;
    sbit    PI2C        =           IP2^6;
    sbit    PCMP        =           IP2^5;
    sbit    PX4         =           IP2^4;
    sbit    PPWMB       =           IP2^3;
    sbit    PPWMA       =           IP2^2;
    sbit    PSPI        =           IP2^1;
    sbit    PS2         =           IP2^0;

sfr         IP2H        =           0xb6;
    sbit    PUSBH       =           IP2H^7;
    sbit    PI2CH       =           IP2H^6;
    sbit    PCMPH       =           IP2H^5;
    sbit    PX4H        =           IP2H^4;
    sbit    PPWMBH      =           IP2H^3;
    sbit    PPWMAH      =           IP2H^2;
    sbit    PSPIH       =           IP2H^1;
    sbit    PS2H        =           IP2H^0;

sfr         IPH         =           0xb7;
    sbit    PPCAH       =           IPH^7;
    sbit    PLVDH       =           IPH^6;
    sbit    PADCH       =           IPH^5;
    sbit    PSH         =           IPH^4;
    sbit    PT1H        =           IPH^3;
    sbit    PX1H        =           IPH^2;
    sbit    PT0H        =           IPH^1;
    sbit    PX0H        =           IPH^0;

sfr         IP          =           0xb8;
    sbit    PPCA        =           IP^7;
    sbit    PLVD        =           IP^6;
    sbit    PADC        =           IP^5;
    sbit    PS          =           IP^4;
    sbit    PT1         =           IP^3;
    sbit    PX1         =           IP^2;
    sbit    PT0         =           IP^1;
    sbit    PX0         =           IP^0;

sfr         SADEN       =           0xb9;

sfr         P_SW2       =           0xba;
    sbit    EAXFR       =           P_SW2^7;
    sbit    I2C_S1      =           P_SW2^5;
    sbit    I2C_S0      =           P_SW2^4;
    sbit    CMPO_S      =           P_SW2^3;
    sbit    S4_S        =           P_SW2^2;
    sbit    S3_S        =           P_SW2^1;
    sbit    S2_S        =           P_SW2^0;

sfr         P_SW3       =           0xbb;
    sbit    I2S_S1      =           P_SW3^7;
    sbit    I2S_S0      =           P_SW3^6;
    sbit    S2SPI_S1    =           P_SW3^5;
    sbit    S2SPI_S0    =           P_SW3^4;
    sbit    S1SPI_S1    =           P_SW3^3;
    sbit    S1SPI_S0    =           P_SW3^2;
    sbit    CAN2_S1     =           P_SW3^1;
    sbit    CAN2_S0     =           P_SW3^0;

sfr         ADC_CONTR   =           0xbc;
    sbit    ADC_POWER   =           ADC_CONTR^7;
    sbit    ADC_START   =           ADC_CONTR^6;
    sbit    ADC_FLAG    =           ADC_CONTR^5;
    sbit    ADC_EPWMT   =           ADC_CONTR^4;

sfr         ADC_RES     =           0xbd;
sfr         ADC_RESL    =           0xbe;

sfr         P_SW4       =           0xbf;
    sbit    QSPI_S1     =           P_SW4^1;
    sbit    QSPI_S0     =           P_SW4^0;

sfr         P4          =           0xc0;
    sbit    P40         =           P4^0;
    sbit    P41         =           P4^1;
    sbit    P42         =           P4^2;
    sbit    P43         =           P4^3;
    sbit    P44         =           P4^4;
    sbit    P45         =           P4^5;
    sbit    P46         =           P4^6;
    sbit    P47         =           P4^7;

sfr         WDT_CONTR   =           0xc1;
    sbit    WDT_FLAG    =           WDT_CONTR^7;
    sbit    EN_WDT      =           WDT_CONTR^5;
    sbit    CLR_WDT     =           WDT_CONTR^4;
    sbit    IDL_WDT     =           WDT_CONTR^3;

sfr         IAP_DATA    =           0xc2;
sfr         IAP_ADDRH   =           0xc3;
sfr         IAP_ADDRL   =           0xc4;
sfr         IAP_CMD     =           0xc5;
sfr         IAP_TRIG    =           0xc6;

sfr         IAP_CONTR   =           0xc7;
    sbit    IAPEN       =           IAP_CONTR^7;
    sbit    SWBS        =           IAP_CONTR^6;
    sbit    SWRST       =           IAP_CONTR^5;
    sbit    CMD_FAIL    =           IAP_CONTR^4;
    sbit    SWBS2       =           IAP_CONTR^3;

sfr         P5          =           0xc8;
    sbit    P50         =           P5^0;
    sbit    P51         =           P5^1;
    sbit    P52         =           P5^2;
    sbit    P53         =           P5^3;
    sbit    P54         =           P5^4;
    sbit    P55         =           P5^5;
    sbit    P56         =           P5^6;
    sbit    P57         =           P5^7;

sfr         P5M1        =           0xc9;
sfr         P5M0        =           0xca;
sfr         P6M1        =           0xcb;
sfr         P6M0        =           0xcc;

sfr         SPSTAT      =           0xcd;
    sbit    SPIF        =           SPSTAT^7;
    sbit    WCOL        =           SPSTAT^6;

sfr         SPCTL       =           0xce;
    sbit    SSIG        =           SPCTL^7;
    sbit    SPEN        =           SPCTL^6;
    sbit    DORD        =           SPCTL^5;
    sbit    MSTR        =           SPCTL^4;
    sbit    CPOL        =           SPCTL^3;
    sbit    CPHA        =           SPCTL^2;
    sbit    SPR1        =           SPCTL^1;
    sbit    SPR0        =           SPCTL^0;

sfr         SPDAT       =           0xcf;

sfr         PSW         =           0xd0;
    sbit    CY          =           PSW^7;
    sbit    AC          =           PSW^6;
    sbit    F0          =           PSW^5;
    sbit    RS1         =           PSW^4;
    sbit    RS0         =           PSW^3;
    sbit    OV          =           PSW^2;
    sbit    F1          =           PSW^1;
    sbit    P           =           PSW^0;

sfr         PSW1        =           0xd1;
    sbit    N           =           PSW1^5;
    sbit    Z           =           PSW1^1;

sfr         T4H         =           0xd2;
sfr         T4L         =           0xd3;
sfr         T3H         =           0xd4;
sfr         T3L         =           0xd5;
sfr         T2H         =           0xd6;
sfr         T2L         =           0xd7;

sfr         TH4         =           0xd2;
sfr         TL4         =           0xd3;
sfr         TH3         =           0xd4;
sfr         TL3         =           0xd5;
sfr         TH2         =           0xd6;
sfr         TL2         =           0xd7;

