yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
#define     P0NCS                   (*(unsigned char volatile far *)0x7efe18)
#define     P1NCS                   (*(unsigned char volatile far *)0x7efe19)
#define     P2NCS                   (*(unsigned char volatile far *)0x7efe1a)
#define     P3NCS                   (*(unsigned char volatile far *)0x7efe1b)
#define     P4NCS                   (*(unsigned char volatile far *)0x7efe1c)
#define     P5NCS                   (*(unsigned char volatile far *)0x7efe1d)
#define     P6NCS                   (*(unsigned char volatile far *)0x7efe1e)
#define     P7NCS                   (*(unsigned char volatile far *)0x7efe1f)

#define     P0SR                    (*(unsigned char volatile far *)0x7efe20)
#define     P1SR                    (*(unsigned char volatile far *)0x7efe21)
#define     P2SR                    (*(unsigned char volatile far *)0x7efe22)
#define     P3SR                    (*(unsigned char volatile far *)0x7efe23)
#define     P4SR                    (*(unsigned char volatile far *)0x7efe24)
#define     P5SR                    (*(unsigned char volatile far *)0x7efe25)
#define     P6SR                    (*(unsigned char volatile far *)0x7efe26)
#define     P7SR                    (*(unsigned char volatile far *)0x7efe27)

#define     P0DR                    (*(unsigned char volatile far *)0x7efe28)
#define     P1DR                    (*(unsigned char volatile far *)0x7efe29)
#define     P2DR                    (*(unsigned char volatile far *)0x7efe2a)
#define     P3DR                    (*(unsigned char volatile far *)0x7efe2b)
#define     P4DR                    (*(unsigned char volatile far *)0x7efe2c)
#define     P5DR                    (*(unsigned char volatile far *)0x7efe2d)
#define     P6DR                    (*(unsigned char volatile far *)0x7efe2e)
#define     P7DR                    (*(unsigned char volatile far *)0x7efe2f)

#define     P0IE                    (*(unsigned char volatile far *)0x7efe30)
#define     P1IE                    (*(unsigned char volatile far *)0x7efe31)
#define     P2IE                    (*(unsigned char volatile far *)0x7efe32)
#define     P3IE                    (*(unsigned char volatile far *)0x7efe33)
#define     P4IE                    (*(unsigned char volatile far *)0x7efe34)
#define     P5IE                    (*(unsigned char volatile far *)0x7efe35)
#define     P6IE                    (*(unsigned char volatile far *)0x7efe36)
#define     P7IE                    (*(unsigned char volatile far *)0x7efe37)

#define     P0PD                    (*(unsigned char volatile far *)0x7efe40)
#define     P1PD                    (*(unsigned char volatile far *)0x7efe41)
#define     P2PD                    (*(unsigned char volatile far *)0x7efe42)
#define     P3PD                    (*(unsigned char volatile far *)0x7efe43)
#define     P4PD                    (*(unsigned char volatile far *)0x7efe44)
#define     P5PD                    (*(unsigned char volatile far *)0x7efe45)
#define     P6PD                    (*(unsigned char volatile far *)0x7efe46)
#define     P7PD                    (*(unsigned char volatile far *)0x7efe47)

#define     P0BP                    (*(unsigned char volatile far *)0x7efe48)
#define     P1BP                    (*(unsigned char volatile far *)0x7efe49)
#define     P2BP                    (*(unsigned char volatile far *)0x7efe4a)
#define     P3BP                    (*(unsigned char volatile far *)0x7efe4b)
#define     P4BP                    (*(unsigned char volatile far *)0x7efe4c)
#define     P5BP                    (*(unsigned char volatile far *)0x7efe4d)
#define     P6BP                    (*(unsigned char volatile far *)0x7efe4e)
#define     P7BP                    (*(unsigned char volatile far *)0x7efe4f)

#define     LCMIFCFG                (*(unsigned char volatile far *)0x7efe50)
#define     LCMIFCFG2               (*(unsigned char volatile far *)0x7efe51)
#define     LCMIFCR                 (*(unsigned char volatile far *)0x7efe52)
#define     LCMIFSTA                (*(unsigned char volatile far *)0x7efe53)
#define     LCMIFDATL               (*(unsigned char volatile far *)0x7efe54)
#define     LCMIFDATH               (*(unsigned char volatile far *)0x7efe55)
#define     LCMIFPSCR               (*(unsigned char volatile far *)0x7efe56)

#define     RSTCR6                  (*(unsigned char volatile far *)0x7efe58)
#define     RSTCR7                  (*(unsigned char volatile far *)0x7efe59)
#define     RSTCR8                  (*(unsigned char volatile far *)0x7efe5a)
#define     RSTCR9                  (*(unsigned char volatile far *)0x7efe5b)
#define     RSTCR10                 (*(unsigned char volatile far *)0x7efe5c)
#define     RSTCR11                 (*(unsigned char volatile far *)0x7efe5d)
#define     RSTCR12                 (*(unsigned char volatile far *)0x7efe5e)
#define     RSTCR13                 (*(unsigned char volatile far *)0x7efe5f)

#define     RTCCR                   (*(unsigned char volatile far *)0x7efe60)
#define     RTCCFG                  (*(unsigned char volatile far *)0x7efe61)
#define     RTCIEN                  (*(unsigned char volatile far *)0x7efe62)
#define     RTCIF                   (*(unsigned char volatile far *)0x7efe63)
#define     ALAHOUR                 (*(unsigned char volatile far *)0x7efe64)
#define     ALAMIN                  (*(unsigned char volatile far *)0x7efe65)
#define     ALASEC                  (*(unsigned char volatile far *)0x7efe66)
#define     ALASSEC                 (*(unsigned char volatile far *)0x7efe67)
#define     INIYEAR                 (*(unsigned char volatile far *)0x7efe68)
#define     INIMONTH                (*(unsigned char volatile far *)0x7efe69)
#define     INIDAY                  (*(unsigned char volatile far *)0x7efe6a)
#define     INIHOUR                 (*(unsigned char volatile far *)0x7efe6b)
#define     INIMIN                  (*(unsigned char volatile far *)0x7efe6c)
#define     INISEC                  (*(unsigned char volatile far *)0x7efe6d)
#define     INISSEC                 (*(unsigned char volatile far *)0x7efe6e)
#define     RTCWEEK                 (*(unsigned char volatile far *)0x7efe6f)
#define     RTCYEAR                 (*(unsigned char volatile far *)0x7efe70)
#define     RTCMONTH                (*(unsigned char volatile far *)0x7efe71)
#define     RTCDAY                  (*(unsigned char volatile far *)0x7efe72)
#define     RTCHOUR                 (*(unsigned char volatile far *)0x7efe73)
#define     RTCMIN                  (*(unsigned char volatile far *)0x7efe74)
#define     RTCSEC                  (*(unsigned char volatile far *)0x7efe75)
#define     RTCSSEC                 (*(unsigned char volatile far *)0x7efe76)

