yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
#define     DMA_I2ST_AMTH           (*(unsigned char volatile far *)0x7efac0)
#define     DMA_I2ST_DONEH          (*(unsigned char volatile far *)0x7efac1)
#define     DMA_I2SR_AMTH           (*(unsigned char volatile far *)0x7efac2)
#define     DMA_I2SR_DONEH          (*(unsigned char volatile far *)0x7efac3)
#define     DMA_I2C_ITVH            (*(unsigned char volatile far *)0x7efac4)
#define     DMA_I2C_ITVL            (*(unsigned char volatile far *)0x7efac5)
#define     DMA_I2S_ITVH            (*(unsigned char volatile far *)0x7efac6)
#define     DMA_I2S_ITVL            (*(unsigned char volatile far *)0x7efac7)
#define     DMA_UR1_ITVH            (*(unsigned char volatile far *)0x7efac8)
#define     DMA_UR1_ITVL            (*(unsigned char volatile far *)0x7efac9)
#define     DMA_UR2_ITVH            (*(unsigned char volatile far *)0x7efaca)
#define     DMA_UR2_ITVL            (*(unsigned char volatile far *)0x7efacb)
#define     DMA_UR3_ITVH            (*(unsigned char volatile far *)0x7efacc)
#define     DMA_UR3_ITVL            (*(unsigned char volatile far *)0x7efacd)
#define     DMA_UR4_ITVH            (*(unsigned char volatile far *)0x7eface)
#define     DMA_UR4_ITVL            (*(unsigned char volatile far *)0x7efacf)

#define     DMA_QSPI_CFG            (*(unsigned char volatile far *)0x7efad0)
#define     DMA_QSPI_CR             (*(unsigned char volatile far *)0x7efad1)
#define     DMA_QSPI_STA            (*(unsigned char volatile far *)0x7efad2)
#define     DMA_QSPI_AMT            (*(unsigned char volatile far *)0x7efad3)
#define     DMA_QSPI_DONE           (*(unsigned char volatile far *)0x7efad4)
#define     DMA_QSPI_TXAH           (*(unsigned char volatile far *)0x7efad5)
#define     DMA_QSPI_TXAL           (*(unsigned char volatile far *)0x7efad6)
#define     DMA_QSPI_RXAH           (*(unsigned char volatile far *)0x7efad7)
#define     DMA_QSPI_RXAL           (*(unsigned char volatile far *)0x7efad8)
#define     DMA_QSPI_AMTH           (*(unsigned char volatile far *)0x7efadb)
#define     DMA_QSPI_DONEH          (*(unsigned char volatile far *)0x7efadc)
#define     DMA_QSPI_ITVH           (*(unsigned char volatile far *)0x7efade)
#define     DMA_QSPI_ITVL           (*(unsigned char volatile far *)0x7efadf)

#define     DMA_ADC2_CFG            (*(unsigned char volatile far *)0x7efae0)
#define     DMA_ADC2_CR             (*(unsigned char volatile far *)0x7efae1)
#define     DMA_ADC2_STA            (*(unsigned char volatile far *)0x7efae2)
#define     DMA_ADC2_CFG2           (*(unsigned char volatile far *)0x7efae3)
#define     DMA_ADC2_AMTH           (*(unsigned char volatile far *)0x7efae4)
#define     DMA_ADC2_AMT            (*(unsigned char volatile far *)0x7efae5)
#define     DMA_ADC2_DONEH          (*(unsigned char volatile far *)0x7efae6)
#define     DMA_ADC2_DONE           (*(unsigned char volatile far *)0x7efae7)
#define     DMA_ADC2_RXAH           (*(unsigned char volatile far *)0x7efae8)
#define     DMA_ADC2_RXAL           (*(unsigned char volatile far *)0x7efae9)
#define     DMA_ADC2_CHSW0          (*(unsigned char volatile far *)0x7efaea)
#define     DMA_ADC2_CHSW1          (*(unsigned char volatile far *)0x7efaeb)
#define     DMA_ADC2_ITVH           (*(unsigned char volatile far *)0x7efaee)
#define     DMA_ADC2_ITVL           (*(unsigned char volatile far *)0x7efaef)

#define     DMA_P2P1_DEST           (*(unsigned char volatile far *)0x7efaf0)
#define     DMA_P2P1_SRC            (*(unsigned char volatile far *)0x7efaf1)
#define     DMA_P2P2_DEST           (*(unsigned char volatile far *)0x7efaf2)
#define     DMA_P2P2_SRC            (*(unsigned char volatile far *)0x7efaf3)

#define     P2P_SRC_UR1RX           0x01
#define     P2P_SRC_UR2RX           0x02
#define     P2P_SRC_UR3RX           0x03
#define     P2P_SRC_UR4RX           0x04
#define     P2P_SRC_SPI1RX          0x05
#define     P2P_SRC_I2C1RX          0x06
#define     P2P_SRC_LCMRX           0x07
#define     P2P_SRC_QSPIRX          0x08
#define     P2P_SRC_ADC1            0x09
#define     P2P_SRC_I2S1RX          0x0A
#define     P2P_SRC_UR5RX           0x0B
#define     P2P_SRC_UR6RX           0x0C
#define     P2P_SRC_UR7RX           0x0D
#define     P2P_SRC_UR8RX           0x0E
#define     P2P_SRC_SPI2RX          0x0F
#define     P2P_SRC_SPI3RX          0x10
#define     P2P_SRC_SPI4RX          0x11
#define     P2P_SRC_I2C2RX          0x12
#define     P2P_SRC_I2S2RX          0x13
#define     P2P_SRC_CAN1RX          0x16
#define     P2P_SRC_CAN2RX          0x17
#define     P2P_SRC_ADC2            0x18

#define     P2P_DEST_UR1TX          0x01
#define     P2P_DEST_UR2TX          0x02
#define     P2P_DEST_UR3TX          0x03
#define     P2P_DEST_UR4TX          0x04
#define     P2P_DEST_SPI1TX         0x05
#define     P2P_DEST_I2C1TX         0x06
#define     P2P_DEST_LCMTX          0x07
#define     P2P_DEST_QSPITX         0x08
#define     P2P_DEST_I2S1TX         0x0A
#define     P2P_DEST_UR5TX          0x0B
#define     P2P_DEST_UR6TX          0x0C
#define     P2P_DEST_UR7TX          0x0D
#define     P2P_DEST_UR8TX          0x0E
#define     P2P_DEST_SPI2TX         0x0F
#define     P2P_DEST_SPI3TX         0x10
#define     P2P_DEST_SPI4TX         0x11
#define     P2P_DEST_I2C2TX         0x12
#define     P2P_DEST_I2S2TX         0x13
#define     P2P_DEST_DAC1TX         0x14
#define     P2P_DEST_DAC2TX         0x15
#define     P2P_DEST_CAN1TX         0x16
#define     P2P_DEST_CAN2TX         0x17

#define     DMA_ARB_CFG             (*(unsigned char volatile far *)0x7efaf8)
#define     DMA_ARB_STA             (*(unsigned char volatile far *)0x7efaf9)

/////////////////////////////////////////////////
//7E:F900H-7E:F9FFH
/////////////////////////////////////////////////

#define     QSPI_CR1                (*(unsigned char volatile far *)0x7ef900)
#define     QSPI_CR2                (*(unsigned char volatile far *)0x7ef901)
#define     QSPI_CR3                (*(unsigned char volatile far *)0x7ef902)
#define     QSPI_CR4                (*(unsigned char volatile far *)0x7ef903)
#define     QSPI_DCR1               (*(unsigned char volatile far *)0x7ef904)
#define     QSPI_DCR2               (*(unsigned char volatile far *)0x7ef905)
#define     QSPI_SR1                (*(unsigned char volatile far *)0x7ef906)
#define     QSPI_SR2                (*(unsigned char volatile far *)0x7ef907)
#define     QSPI_FCR                (*(unsigned char volatile far *)0x7ef908)
#define     QSPI_DLR1               (*(unsigned char volatile far *)0x7ef910)
#define     QSPI_DLR2               (*(unsigned char volatile far *)0x7ef911)
#define     QSPI_CCR1               (*(unsigned char volatile far *)0x7ef914)
#define     QSPI_CCR2               (*(unsigned char volatile far *)0x7ef915)
#define     QSPI_CCR3               (*(unsigned char volatile far *)0x7ef916)
#define     QSPI_CCR4               (*(unsigned char volatile far *)0x7ef917)
#define     QSPI_AR1                (*(unsigned char volatile far *)0x7ef918)
#define     QSPI_AR2                (*(unsigned char volatile far *)0x7ef919)
#define     QSPI_AR3                (*(unsigned char volatile far *)0x7ef91a)
#define     QSPI_AR4                (*(unsigned char volatile far *)0x7ef91b)
#define     QSPI_ABR                (*(unsigned char volatile far *)0x7ef91c)
#define     QSPI_ABR1               (*(unsigned char volatile far *)0x7ef91c)
#define     QSPI_ABR2               (*(unsigned char volatile far *)0x7ef91d)
#define     QSPI_ABR3               (*(unsigned char volatile far *)0x7ef91e)
#define     QSPI_ABR4               (*(unsigned char volatile far *)0x7ef91f)
#define     QSPI_DR                 (*(unsigned char volatile far *)0x7ef920)
#define     QSPI_PSMKR1             (*(unsigned char volatile far *)0x7ef924)
#define     QSPI_PSMAR1             (*(unsigned char volatile far *)0x7ef928)
#define     QSPI_PIR1               (*(unsigned char volatile far *)0x7ef92c)
#define     QSPI_PIR2               (*(unsigned char volatile far *)0x7ef92d)

