yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
#define     PWMA_ENO2               (*(unsigned char volatile far *)0x7ef930)
#define     PWMA_IOAUX2             (*(unsigned char volatile far *)0x7ef931)
#define     PWMA_CR3                (*(unsigned char volatile far *)0x7ef932)
#define     PWMA_SR3                (*(unsigned char volatile far *)0x7ef933)
#define     PWMA_CCER3              (*(unsigned char volatile far *)0x7ef934)
#define     PWMA_CCMR1X             (*(unsigned char volatile far *)0x7ef938)
#define     PWMA_CCMR2X             (*(unsigned char volatile far *)0x7ef939)
#define     PWMA_CCMR3X             (*(unsigned char volatile far *)0x7ef93a)
#define     PWMA_CCMR4X             (*(unsigned char volatile far *)0x7ef93b)
#define     PWMA_CCMR5              (*(unsigned char volatile far *)0x7ef93c)
#define     PWMA_CCMR5X             (*(unsigned char volatile far *)0x7ef93d)
#define     PWMA_CCMR6              (*(unsigned char volatile far *)0x7ef93e)
#define     PWMA_CCMR6X             (*(unsigned char volatile far *)0x7ef93f)
#define     PWMA_CCR5H              (*(unsigned char volatile far *)0x7ef940)
#define     PWMA_CCR5L              (*(unsigned char volatile far *)0x7ef941)
#define     PWMA_CCR5X              (*(unsigned char volatile far *)0x7ef942)
#define     PWMA_CCR6H              (*(unsigned char volatile far *)0x7ef943)
#define     PWMA_CCR6L              (*(unsigned char volatile far *)0x7ef944)
#define     PWMA_DER                (*(unsigned char volatile far *)0x7ef948)
#define     PWMA_DBA                (*(unsigned char volatile far *)0x7ef949)
#define     PWMA_DBL                (*(unsigned char volatile far *)0x7ef94a)
#define     PWMA_DMACR              (*(unsigned char volatile far *)0x7ef94b)

#define     PWMC_ENO2               (*(unsigned char volatile far *)0x7ef950)
#define     PWMC_IOAUX2             (*(unsigned char volatile far *)0x7ef951)
#define     PWMC_CR3                (*(unsigned char volatile far *)0x7ef952)
#define     PWMC_SR3                (*(unsigned char volatile far *)0x7ef953)
#define     PWMC_CCER3              (*(unsigned char volatile far *)0x7ef954)
#define     PWMC_CCMR1X             (*(unsigned char volatile far *)0x7ef958)
#define     PWMC_CCMR2X             (*(unsigned char volatile far *)0x7ef959)
#define     PWMC_CCMR3X             (*(unsigned char volatile far *)0x7ef95a)
#define     PWMC_CCMR4X             (*(unsigned char volatile far *)0x7ef95b)
#define     PWMC_CCMR5              (*(unsigned char volatile far *)0x7ef95c)
#define     PWMC_CCMR5X             (*(unsigned char volatile far *)0x7ef95d)
#define     PWMC_CCMR6              (*(unsigned char volatile far *)0x7ef95e)
#define     PWMC_CCMR6X             (*(unsigned char volatile far *)0x7ef95f)
#define     PWMC_CCR5H              (*(unsigned char volatile far *)0x7ef960)
#define     PWMC_CCR5L              (*(unsigned char volatile far *)0x7ef961)
#define     PWMC_CCR5X              (*(unsigned char volatile far *)0x7ef962)
#define     PWMC_CCR6H              (*(unsigned char volatile far *)0x7ef963)
#define     PWMC_CCR6L              (*(unsigned char volatile far *)0x7ef964)
#define     PWMC_DER                (*(unsigned char volatile far *)0x7ef968)
#define     PWMC_DBA                (*(unsigned char volatile far *)0x7ef969)
#define     PWMC_DBL                (*(unsigned char volatile far *)0x7ef96a)
#define     PWMC_DMACR              (*(unsigned char volatile far *)0x7ef96b)

#define     HSPWMC_CFG              (*(unsigned char volatile far *)0x7ef970)
#define     HSPWMC_ADR              (*(unsigned char volatile far *)0x7ef971)
#define     HSPWMC_DAT              (*(unsigned char volatile far *)0x7ef972)
#define     HSPWMC_ADRH             (*(unsigned char volatile far *)0x7ef973)
#define     HSPWMD_CFG              (*(unsigned char volatile far *)0x7ef974)
#define     HSPWMD_ADR              (*(unsigned char volatile far *)0x7ef975)
#define     HSPWMD_DAT              (*(unsigned char volatile far *)0x7ef976)
#define     HSPWMD_ADRH             (*(unsigned char volatile far *)0x7ef977)

#define     DMA_PWMAT_CFG           (*(unsigned char volatile far *)0x7ef980)
#define     DMA_PWMAT_CR            (*(unsigned char volatile far *)0x7ef981)
#define     DMA_PWMAT_STA           (*(unsigned char volatile far *)0x7ef982)
#define     DMA_PWMAT_AMTH          (*(unsigned char volatile far *)0x7ef984)
#define     DMA_PWMAT_AMT           (*(unsigned char volatile far *)0x7ef985)
#define     DMA_PWMAT_DONEH         (*(unsigned char volatile far *)0x7ef986)
#define     DMA_PWMAT_DONE          (*(unsigned char volatile far *)0x7ef987)
#define     DMA_PWMAT_TXAH          (*(unsigned char volatile far *)0x7ef988)
#define     DMA_PWMAT_TXAL          (*(unsigned char volatile far *)0x7ef989)
#define     DMA_PWMA_ITVH           (*(unsigned char volatile far *)0x7ef98e)
#define     DMA_PWMA_ITVL           (*(unsigned char volatile far *)0x7ef98f)

#define     DMA_PWMAR_CFG           (*(unsigned char volatile far *)0x7ef990)
#define     DMA_PWMAR_CR            (*(unsigned char volatile far *)0x7ef991)
#define     DMA_PWMAR_STA           (*(unsigned char volatile far *)0x7ef992)
#define     DMA_PWMAR_AMTH          (*(unsigned char volatile far *)0x7ef994)
#define     DMA_PWMAR_AMT           (*(unsigned char volatile far *)0x7ef995)
#define     DMA_PWMAR_DONEH         (*(unsigned char volatile far *)0x7ef996)
#define     DMA_PWMAR_DONE          (*(unsigned char volatile far *)0x7ef997)
#define     DMA_PWMAR_RXAH          (*(unsigned char volatile far *)0x7ef998)
#define     DMA_PWMAR_RXAL          (*(unsigned char volatile far *)0x7ef999)

#define     DMA_PWMCT_CFG           (*(unsigned char volatile far *)0x7ef9a0)
#define     DMA_PWMCT_CR            (*(unsigned char volatile far *)0x7ef9a1)
#define     DMA_PWMCT_STA           (*(unsigned char volatile far *)0x7ef9a2)
#define     DMA_PWMCT_AMTH          (*(unsigned char volatile far *)0x7ef9a4)
#define     DMA_PWMCT_AMT           (*(unsigned char volatile far *)0x7ef9a5)
#define     DMA_PWMCT_DONEH         (*(unsigned char volatile far *)0x7ef9a6)
#define     DMA_PWMCT_DONE          (*(unsigned char volatile far *)0x7ef9a7)
#define     DMA_PWMCT_TXAH          (*(unsigned char volatile far *)0x7ef9a8)
#define     DMA_PWMCT_TXAL          (*(unsigned char volatile far *)0x7ef9a9)
#define     DMA_PWMC_ITVH           (*(unsigned char volatile far *)0x7ef9ae)
#define     DMA_PWMC_ITVL           (*(unsigned char volatile far *)0x7ef9af)

