yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
#define     IAP_DATA0               (*(unsigned char volatile far *)0x7ef5f0)
#define     IAP_DATA1               (*(unsigned char volatile far *)0x7ef5f1)
#define     IAP_DATA2               (*(unsigned char volatile far *)0x7ef5f2)
#define     IAP_DATA3               (*(unsigned char volatile far *)0x7ef5f3)
#define     IAP_DATA4               (*(unsigned char volatile far *)0x7ef5f4)
#define     IAP_DATA5               (*(unsigned char volatile far *)0x7ef5f5)
#define     IAP_DATA6               (*(unsigned char volatile far *)0x7ef5f6)
#define     IAP_DATA7               (*(unsigned char volatile far *)0x7ef5f7)
#define     IAP_DATA8               (*(unsigned char volatile far *)0x7ef5f8)
#define     IAP_DATA9               (*(unsigned char volatile far *)0x7ef5f9)
#define     IAP_DATAA               (*(unsigned char volatile far *)0x7ef5fa)
#define     IAP_DATAB               (*(unsigned char volatile far *)0x7ef5fb)
#define     IAP_DATAC               (*(unsigned char volatile far *)0x7ef5fc)
#define     IAP_DATAD               (*(unsigned char volatile far *)0x7ef5fd)
#define     IAP_DATAE               (*(unsigned char volatile far *)0x7ef5fe)
#define     IAP_DATAF               (*(unsigned char volatile far *)0x7ef5ff)

/////////////////////////////////////////////////
//7E:F400H-7E:F4FFH
/////////////////////////////////////////////////

#define     CAN_RBUF                ( (unsigned char volatile far *)0x7ef400)
#define     CAN_TBUF                ( (unsigned char volatile far *)0x7ef450)
#define     CAN_TTS                 ( (unsigned char volatile far *)0x7ef498)
#define     CAN_CFG_STAT            (*(unsigned char volatile far *)0x7ef4a0)
#define     CAN_TCMD                (*(unsigned char volatile far *)0x7ef4a1)
#define     CAN_TCTRL               (*(unsigned char volatile far *)0x7ef4a2)
#define     CAN_RCTRL               (*(unsigned char volatile far *)0x7ef4a3)
#define     CAN_TIE                 (*(unsigned char volatile far *)0x7ef4a4)
#define     CAN_RTIF                (*(unsigned char volatile far *)0x7ef4a5)
#define     CAN_ERRINT              (*(unsigned char volatile far *)0x7ef4a6)
#define     CAN_LIMIT               (*(unsigned char volatile far *)0x7ef4a7)
#define     CAN_S_SEG1              (*(unsigned char volatile far *)0x7ef4a8)
#define     CAN_S_SEG2              (*(unsigned char volatile far *)0x7ef4a9)
#define     CAN_S_SJW               (*(unsigned char volatile far *)0x7ef4aa)
#define     CAN_S_PRESC             (*(unsigned char volatile far *)0x7ef4ab)
#define     CAN_F_SEG1              (*(unsigned char volatile far *)0x7ef4ac)
#define     CAN_F_SEG2              (*(unsigned char volatile far *)0x7ef4ad)
#define     CAN_F_SJW               (*(unsigned char volatile far *)0x7ef4ae)
#define     CAN_F_PRESC             (*(unsigned char volatile far *)0x7ef4af)
#define     CAN_EALCAP              (*(unsigned char volatile far *)0x7ef4b0)
#define     CAN_TDC                 (*(unsigned char volatile far *)0x7ef4b1)
#define     CAN_RECNT               (*(unsigned char volatile far *)0x7ef4b2)
#define     CAN_TECNT               (*(unsigned char volatile far *)0x7ef4b3)
#define     CAN_ACFCTRL             (*(unsigned char volatile far *)0x7ef4b4)
#define     CAN_TIMECFG             (*(unsigned char volatile far *)0x7ef4b5)
#define     CAN_ACF_EN0             (*(unsigned char volatile far *)0x7ef4b6)
#define     CAN_ACF_EN1             (*(unsigned char volatile far *)0x7ef4b7)
#define     CAN_ACF0                (*(unsigned char volatile far *)0x7ef4b8)
#define     CAN_ACF1                (*(unsigned char volatile far *)0x7ef4b9)
#define     CAN_ACF2                (*(unsigned char volatile far *)0x7ef4ba)
#define     CAN_ACF3                (*(unsigned char volatile far *)0x7ef4bb)
#define     CAN_VER0                (*(unsigned char volatile far *)0x7ef4bc)
#define     CAN_VER1                (*(unsigned char volatile far *)0x7ef4bd)
#define     CAN_TBSLOT              (*(unsigned char volatile far *)0x7ef4be)
#define     CAN_TTCFG               (*(unsigned char volatile far *)0x7ef4bf)
#define     CAN_REF_MSG0            (*(unsigned char volatile far *)0x7ef4c0)
#define     CAN_REF_MSG1            (*(unsigned char volatile far *)0x7ef4c1)
#define     CAN_REF_MSG2            (*(unsigned char volatile far *)0x7ef4c2)
#define     CAN_REF_MSG3            (*(unsigned char volatile far *)0x7ef4c3)
#define     CAN_TRIG_CFG0           (*(unsigned char volatile far *)0x7ef4c4)
#define     CAN_TRIG_CFG1           (*(unsigned char volatile far *)0x7ef4c5)
#define     CAN_TT_CFG0             (*(unsigned char volatile far *)0x7ef4c6)
#define     CAN_TT_CFG1             (*(unsigned char volatile far *)0x7ef4c7)
#define     CAN_TT_WTRIG0           (*(unsigned char volatile far *)0x7ef4c8)
#define     CAN_TT_WTRIG1           (*(unsigned char volatile far *)0x7ef4c9)

#define     P0IM2                   (*(unsigned char volatile far *)0x7ef4e0)
#define     P1IM2                   (*(unsigned char volatile far *)0x7ef4e1)
#define     P2IM2                   (*(unsigned char volatile far *)0x7ef4e2)
#define     P3IM2                   (*(unsigned char volatile far *)0x7ef4e3)
#define     P4IM2                   (*(unsigned char volatile far *)0x7ef4e4)
#define     P5IM2                   (*(unsigned char volatile far *)0x7ef4e5)
#define     P6IM2                   (*(unsigned char volatile far *)0x7ef4e6)
#define     P7IM2                   (*(unsigned char volatile far *)0x7ef4e7)
#define     P8IM2                   (*(unsigned char volatile far *)0x7ef4e8)
#define     P9IM2                   (*(unsigned char volatile far *)0x7ef4e9)
#define     PAIM2                   (*(unsigned char volatile far *)0x7ef4ea)
#define     PBIM2                   (*(unsigned char volatile far *)0x7ef4eb)
#define     PCIM2                   (*(unsigned char volatile far *)0x7ef4ec)
#define     PDIM2                   (*(unsigned char volatile far *)0x7ef4ed)
#define     PEIM2                   (*(unsigned char volatile far *)0x7ef4ee)
#define     PFIM2                   (*(unsigned char volatile far *)0x7ef4ef)

