yuan777coder/car/car/docs/_stc_tmp/seekfree_stc32g144k246.h
#define     CPU_CRR_CFG             (*(unsigned char volatile far *)0x7ef4f0)
#define     CPU_CRR_KEY0            (*(unsigned char volatile far *)0x7ef4f1)
#define     CPU_CRR_KEY1            (*(unsigned char volatile far *)0x7ef4f2)
#define     CPU_CRR_KEY2            (*(unsigned char volatile far *)0x7ef4f3)
#define     CRR_READ_SELH           (*(unsigned char volatile far *)0x7ef4f4)
#define     CRR_READ_SELL           (*(unsigned char volatile far *)0x7ef4f5)
#define     CRR_READ_DATA           (*(unsigned char volatile far *)0x7ef4f6)

#define     IO_WUP_PRD              (*(unsigned char volatile far *)0x7ef4f8)
#define     CPU_WUP_PRD             (*(unsigned char volatile far *)0x7ef4f9)
#define     CPU_STOP_CNTH           (*(unsigned char volatile far *)0x7ef4fa)
#define     CPU_STOP_CNTL           (*(unsigned char volatile far *)0x7ef4fb)

/////////////////////////////////////////////////
//7E:F300H-7E:F3FFH
/////////////////////////////////////////////////

#define     CAN2_RBUF               ( (unsigned char volatile far *)0x7ef300)
#define     CAN2_TBUF               ( (unsigned char volatile far *)0x7ef350)
#define     CAN2_TTS                ( (unsigned char volatile far *)0x7ef398)
#define     CAN2_CFG_STAT           (*(unsigned char volatile far *)0x7ef3a0)
#define     CAN2_TCMD               (*(unsigned char volatile far *)0x7ef3a1)
#define     CAN2_TCTRL              (*(unsigned char volatile far *)0x7ef3a2)
#define     CAN2_RCTRL              (*(unsigned char volatile far *)0x7ef3a3)
#define     CAN2_TIE                (*(unsigned char volatile far *)0x7ef3a4)
#define     CAN2_RTIF               (*(unsigned char volatile far *)0x7ef3a5)
#define     CAN2_ERRINT             (*(unsigned char volatile far *)0x7ef3a6)
#define     CAN2_LIMIT              (*(unsigned char volatile far *)0x7ef3a7)
#define     CAN2_S_SEG1             (*(unsigned char volatile far *)0x7ef3a8)
#define     CAN2_S_SEG2             (*(unsigned char volatile far *)0x7ef3a9)
#define     CAN2_S_SJW              (*(unsigned char volatile far *)0x7ef3aa)
#define     CAN2_S_PRESC            (*(unsigned char volatile far *)0x7ef3ab)
#define     CAN2_F_SEG1             (*(unsigned char volatile far *)0x7ef3ac)
#define     CAN2_F_SEG2             (*(unsigned char volatile far *)0x7ef3ad)
#define     CAN2_F_SJW              (*(unsigned char volatile far *)0x7ef3ae)
#define     CAN2_F_PRESC            (*(unsigned char volatile far *)0x7ef3af)
#define     CAN2_EALCAP             (*(unsigned char volatile far *)0x7ef3b0)
#define     CAN2_TDC                (*(unsigned char volatile far *)0x7ef3b1)
#define     CAN2_RECNT              (*(unsigned char volatile far *)0x7ef3b2)
#define     CAN2_TECNT              (*(unsigned char volatile far *)0x7ef3b3)
#define     CAN2_ACFCTRL            (*(unsigned char volatile far *)0x7ef3b4)
#define     CAN2_TIMECFG            (*(unsigned char volatile far *)0x7ef3b5)
#define     CAN2_ACF_EN0            (*(unsigned char volatile far *)0x7ef3b6)
#define     CAN2_ACF_EN1            (*(unsigned char volatile far *)0x7ef3b7)
#define     CAN2_ACF0               (*(unsigned char volatile far *)0x7ef3b8)
#define     CAN2_ACF1               (*(unsigned char volatile far *)0x7ef3b9)
#define     CAN2_ACF2               (*(unsigned char volatile far *)0x7ef3ba)
#define     CAN2_ACF3               (*(unsigned char volatile far *)0x7ef3bb)
#define     CAN2_VER0               (*(unsigned char volatile far *)0x7ef3bc)
#define     CAN2_VER1               (*(unsigned char volatile far *)0x7ef3bd)
#define     CAN2_TBSLOT             (*(unsigned char volatile far *)0x7ef3be)
#define     CAN2_TTCFG              (*(unsigned char volatile far *)0x7ef3bf)
#define     CAN2_REF_MSG0           (*(unsigned char volatile far *)0x7ef3c0)
#define     CAN2_REF_MSG1           (*(unsigned char volatile far *)0x7ef3c1)
#define     CAN2_REF_MSG2           (*(unsigned char volatile far *)0x7ef3c2)
#define     CAN2_REF_MSG3           (*(unsigned char volatile far *)0x7ef3c3)
#define     CAN2_TRIG_CFG0          (*(unsigned char volatile far *)0x7ef3c4)
#define     CAN2_TRIG_CFG1          (*(unsigned char volatile far *)0x7ef3c5)
#define     CAN2_TT_CFG0            (*(unsigned char volatile far *)0x7ef3c6)
#define     CAN2_TT_CFG1            (*(unsigned char volatile far *)0x7ef3c7)
#define     CAN2_TT_WTRIG0          (*(unsigned char volatile far *)0x7ef3c8)
#define     CAN2_TT_WTRIG1          (*(unsigned char volatile far *)0x7ef3c9)

/////////////////////////////////////////////////
//LIN Control Regiter
/////////////////////////////////////////////////

#define     LBUF                    0x00
#define     LSEL                    0x01
#define     LID                     0x02
#define     LER                     0x03
#define     LIE                     0x04
#define     LSR                     0x05
#define     LCR                     0x05
#define     DLL                     0x06
#define     DLH                     0x07
#define     HDRL                    0x08
#define     HDRH                    0x09
#define     HDP                     0x0A

/////////////////////////////////////////////////
//USB Control Regiter
/////////////////////////////////////////////////

#define     USBBASE                 0
#define     FADDR                   (USBBASE + 0)
#define     UPDATE                  0x80
#define     POWER                   (USBBASE + 1)
#define     ISOUD                   0x80
#define     USBRST                  0x08
#define     USBRSU                  0x04
#define     USBSUS                  0x02
#define     ENSUS                   0x01
#define     INTRIN1                 (USBBASE + 2)
#define     EP5INIF                 0x20
#define     EP4INIF                 0x10
#define     EP3INIF                 0x08
#define     EP2INIF                 0x04
#define     EP1INIF                 0x02
#define     EP0IF                   0x01
#define     INTROUT1                (USBBASE + 4)
#define     EP5OUTIF                0x20
#define     EP4OUTIF                0x10
#define     EP3OUTIF                0x08
#define     EP2OUTIF                0x04
#define     EP1OUTIF                0x02
#define     INTRUSB                 (USBBASE + 6)
#define     SOFIF                   0x08
#define     RSTIF                   0x04
#define     RSUIF                   0x02
#define     SUSIF                   0x01
#define     INTRIN1E                (USBBASE + 7)
#define     EP5INIE                 0x20
#define     EP4INIE                 0x10
#define     EP3INIE                 0x08
#define     EP2INIE                 0x04
#define     EP1INIE                 0x02
#define     EP0IE                   0x01
#define     INTROUT1E               (USBBASE + 9)
#define     EP5OUTIE                0x20
#define     EP4OUTIE                0x10
#define     EP3OUTIE                0x08
#define     EP2OUTIE                0x04
#define     EP1OUTIE                0x02
#define     INTRUSBE                (USBBASE + 11)
#define     SOFIE                   0x08
#define     RSTIE                   0x04
#define     RSUIE                   0x02
#define     SUSIE                   0x01
#define     FRAME1                  (USBBASE + 12)
#define     FRAME2                  (USBBASE + 13)
#define     INDEX                   (USBBASE + 14)
#define     INMAXP                  (USBBASE + 16)
#define     CSR0                    (USBBASE + 17)
#define     SSUEND                  0x80
#define     SOPRDY                  0x40
#define     SDSTL                   0x20
#define     SUEND                   0x10
#define     DATEND                  0x08
#define     STSTL                   0x04
#define     IPRDY                   0x02
#define     OPRDY                   0x01
#define     INCSR1                  (USBBASE + 17)
#define     INCLRDT                 0x40
#define     INSTSTL                 0x20
#define     INSDSTL                 0x10
#define     INFLUSH                 0x08
#define     INUNDRUN                0x04
#define     INFIFONE                0x02
#define     INIPRDY                 0x01
#define     INCSR2                  (USBBASE + 18)
#define     INAUTOSET               0x80
#define     INISO                   0x40
#define     INMODEIN                0x20
#define     INMODEOUT               0x00
#define     INENDMA                 0x10
#define     INFCDT                  0x08
#define     OUTMAXP                 (USBBASE + 19)
#define     OUTCSR1                 (USBBASE + 20)
#define     OUTCLRDT                0x80
#define     OUTSTSTL                0x40
#define     OUTSDSTL                0x20
#define     OUTFLUSH                0x10
#define     OUTDATERR               0x08
#define     OUTOVRRUN               0x04
#define     OUTFIFOFUL              0x02
#define     OUTOPRDY                0x01
#define     OUTCSR2                 (USBBASE + 21)
#define     OUTAUTOCLR              0x80
#define     OUTISO                  0x40
#define     OUTENDMA                0x20
#define     OUTDMAMD                0x10
#define     COUNT0                  (USBBASE + 22)
#define     OUTCOUNT1               (USBBASE + 22)
#define     OUTCOUNT2               (USBBASE + 23)
#define     FIFO0                   (USBBASE + 32)
#define     FIFO1                   (USBBASE + 33)
#define     FIFO2                   (USBBASE + 34)
#define     FIFO3                   (USBBASE + 35)
#define     FIFO4                   (USBBASE + 36)
#define     FIFO5                   (USBBASE + 37)
#define     UTRKCTL                 (USBBASE + 48)
#define     UTRKSTS                 (USBBASE + 49)

/////////////////////////////////////////////////
//Interrupt Vector
/////////////////////////////////////////////////

#define     INT0_VECTOR             0       //0003H
#define     TMR0_VECTOR             1       //000BH
#define     INT1_VECTOR             2       //0013H
#define     TMR1_VECTOR             3       //001BH
#define     UART1_VECTOR            4       //0023H
#define     ADC_VECTOR              5       //002BH
#define     LVD_VECTOR              6       //0033H
#define     PCA_VECTOR              7       //003BH
#define     UART2_VECTOR            8       //0043H
#define     SPI_VECTOR              9       //004BH
#define     INT2_VECTOR             10      //0053H
#define     INT3_VECTOR             11      //005BH
#define     TMR2_VECTOR             12      //0063H
#define     USER_VECTOR             13      //006BH
#define     INT4_VECTOR             16      //0083H
#define     UART3_VECTOR            17      //008BH
#define     UART4_VECTOR            18      //0093H
#define     TMR3_VECTOR             19      //009BH
#define     TMR4_VECTOR             20      //00A3H
#define     CMP_VECTOR              21      //00ABH
#define     I2C_VECTOR              24      //00C3H
#define     USB_VECTOR              25      //00CBH
#define     PWMA_VECTOR             26      //00D3H
#define     PWMB_VECTOR             27      //00DBH
#define     CAN1_VECTOR             28      //00E3H
#define     CAN2_VECTOR             29      //00EBH
#define     LIN1_VECTOR             30      //00F3H
#define     LIN2_VECTOR             31      //00FBH

#define     RTC_VECTOR              36      //0123H
#define     P0INT_VECTOR            37      //012BH
#define     P1INT_VECTOR            38      //0133H
#define     P2INT_VECTOR            39      //013BH
#define     P3INT_VECTOR            40      //0143H
#define     P4INT_VECTOR            41      //014BH
#define     P5INT_VECTOR            42      //0153H
#define     P6INT_VECTOR            43      //015BH
#define     P7INT_VECTOR            44      //0163H
#define     P8INT_VECTOR            45      //016BH
#define     P9INT_VECTOR            46      //0173H
#define     DMA_M2M_VECTOR          47      //017BH
#define     DMA_ADC_VECTOR          48      //0183H
#define     DMA_SPI_VECTOR          49      //018BH
#define     DMA_UR1T_VECTOR         50      //0193H
#define     DMA_UR1R_VECTOR         51      //019BH
#define     DMA_UR2T_VECTOR         52      //01A3H
#define     DMA_UR2R_VECTOR         53      //01ABH
#define     DMA_UR3T_VECTOR         54      //01B3H
#define     DMA_UR3R_VECTOR         55      //01BBH
#define     DMA_UR4T_VECTOR         56      //01C3H
#define     DMA_UR4R_VECTOR         57      //01CBH
#define     DMA_LCM_VECTOR          58      //01D3H
#define     LCM_VECTOR              59      //01DBH
#define     DMA_I2CT_VECTOR         60      //01E3H
#define     DMA_I2CR_VECTOR         61      //01EBH
#define     I2S_VECTOR              62      //01F3H
#define     DMA_I2ST_VECTOR         63      //01FBH
#define     DMA_I2SR_VECTOR         64      //0203H
#define     DMA_QSPI_VECTOR         65      //020BH
#define     QSPI_VECTOR             66      //0213H
#define     TMR11_VECTOR            67      //021BH
#define     DMA_I2C2T_VECTOR        68      //0223H
#define     DMA_I2C2R_VECTOR        69      //022BH
#define     DMA_I2S2T_VECTOR        70      //0233H
#define     DMA_I2S2R_VECTOR        71      //023BH
#define     DMA_PWMAT_VECTOR        72      //0243H
#define     DMA_PWMAR_VECTOR        73      //024BH
#define     DMA_PWMCT_VECTOR        74      //0253H
#define     DMA_PWMCR_VECTOR        75      //025BH
#define     DMA_ADC2_VECTOR         76      //0263H
#define     DMA_DAC_VECTOR          77      //026BH
#define     DMA_DAC2_VECTOR         78      //0273H
#define     DMA_SPI2_VECTOR         79      //027BH
#define     DMA_SPI3_VECTOR         80      //0283H
#define     DMA_SPI4_VECTOR         81      //028BH
#define     DMA_UR5T_VECTOR         82      //0293H
#define     DMA_UR5R_VECTOR         83      //029BH
#define     DMA_UR6T_VECTOR         84      //02A3H
#define     DMA_UR6R_VECTOR         85      //02ABH
#define     DMA_UR7T_VECTOR         86      //02B3H
#define     DMA_UR7R_VECTOR         87      //02BBH
#define     DMA_UR8T_VECTOR         88      //02C3H
#define     DMA_UR8R_VECTOR         89      //02CBH
#define     PAINT_VECTOR            90      //02D3H
#define     PBINT_VECTOR            91      //02DBH
#define     PCINT_VECTOR            92      //02E3H
#define     PDINT_VECTOR            93      //02EBH
#define     PEINT_VECTOR            94      //02F3H
#define     PFINT_VECTOR            95      //02FBH
#define     TMR5_TMR6_VECTOR        96      //0303H
#define     TMR7_TMR8_VECTOR        97      //030BH
#define     TMR9_TMR10_VECTOR       98      //0313H
#define     TMR17_TMR18_VECTOR      99      //031BH
#define     UART5_VECTOR            102     //0333H
#define     UART6_VECTOR            103     //033BH
#define     UART7_VECTOR            104     //0343H
#define     UART8_VECTOR            105     //034BH
#define     ADC2_VECTOR             106     //0353H
#define     DAC_VECTOR              107     //035BH
#define     DAC2_VECTOR             108     //0363H
#define     I2C2_VECTOR             109     //036BH
#define     I2S2_VECTOR             110     //0373H
#define     SPI2_VECTOR             111     //037BH
#define     SPI3_VECTOR             112     //0383H
#define     SPI4_VECTOR             113     //038BH
#define     CMP2_VECTOR             114     //0393H
#define     CMP3_VECTOR             115     //039BH
#define     CMP4_VECTOR             116     //03A3H
#define     DMA_CANT_VECTOR         117     //03ABH
#define     DMA_CANR_VECTOR         118     //03B3H
#define     DMA_CAN2T_VECTOR        119     //03BBH
#define     DMA_CAN2R_VECTOR        120     //03C3H
#define     PWMC_VECTOR             121     //03CBH
#define     PWMD_VECTOR             122     //03D3H
#define     PWME_VECTOR             123     //03DBH
#define     PWMF_VECTOR             124     //03E3H
#define     DMA_PWMET_VECTOR        125     //03EBH
#define     DMA_PWMER_VECTOR        126     //03F3H

/////////////////////////////////////////////////

